Тестовая_база_ERP_14/src/DataProcessors/АГ_ИнтерактивныйРабочийСтолТендеры/АГ_ИнтерактивныйРабочийСтолТендеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АГ_ИнтерактивныйРабочийСтолТендеры</name>
</mdclass:DataProcessor>

Тестовая_база_ERP_14/src/Documents/АГ_Тендер/АГ_Тендер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АГ_Тендер</name>
  <registerRecords>InformationRegister.АГ_ИсторияТендеров</registerRecords>
  <attributes>
    <name>НомерЗакупки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЗаказчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ШагТендера</name>
    <type>
      <types>EnumRef.АГ_ШагиТендера</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПубликации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяДатаОтвета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОПЗ</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаключенияДоговора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодведенияИтогов</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Аукцион</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАукциона</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НМЦ</name>
    <comment>Начальная минимальная цена лота</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПревышениеНМЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПродавец</name>
    <type>
      <types>EnumRef.АГ_ОрганизацияПродавец</types>
    </type>
  </attributes>
  <attributes>
    <name>НашеЦеновоеПредложение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗакупкаДляМСП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбеспечениеЗаявки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбеспечениеДоговора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГОЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПодачиПредложения</name>
    <type>
      <types>EnumRef.АГ_ВидПодачиПредложения</types>
    </type>
  </attributes>
  <attributes>
    <name>Сортамент</name>
    <type>
      <types>EnumRef.АГ_Сортамент</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭТП</name>
    <type>
      <types>CatalogRef.АГ_ЭлектронныеТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаЗакупку</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаРаспределение</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаМониторинг</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусТендера</name>
    <type>
      <types>EnumRef.АГ_СтатусТендера</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтогиОЭТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогиМП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНеучастия</name>
    <type>
      <types>CatalogRef.АГ_ПричиныНеучастияВТендере</types>
    </type>
  </attributes>
  <attributes>
    <name>Победитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТоннажПобеды</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПобеды</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорЗаключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметИОсобенностиЗакупки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлПротокола</name>
    <type>
      <types>CatalogRef.АГ_ТендерПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйКураторОЭТ</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РегионПоставки</name>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбеспечениеЗаявкиПримечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбеспечениеДоговораПримечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КритерииОценки</name>
    <attributes>
      <name>КритерийОценки</name>
      <type>
        <types>CatalogRef.АГ_КритерииОценки</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Шаг</name>
      <type>
        <types>EnumRef.АГ_ШагиТендера</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСтатуса</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСогласования</name>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>EnumRef.АГ_РолиСогласованияТендера</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>EnumRef.АГ_РезультатСогласованияТендера</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаНеучастия</name>
      <type>
        <types>CatalogRef.АГ_ПричиныНеучастияВТендере</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеПоЗаявке</name>
    <attributes>
      <name>ПрисоединенныйФайл</name>
      <type>
        <types>CatalogRef.АГ_ТендерПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/DataProcessors/АГ_ИнтерактивныйРабочийСтолТендеры/Forms/ФормаВыгрузки/Module.bsl
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ВыборФайла.Заголовок = "Выбор файла для сохранения";
	ВыборФайла.Фильтр	= "Таблица Excel (*.xls)|*.xls|Таблица Excel (*.xlsx)|*.xlsx";
	ВыборФайла.Показать(Новый ОписаниеОповещения("ОбработкаВыбораФайла", ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если (ВыбранныеФайлы <> Неопределено) И ВыбранныеФайлы.Количество() > 0 Тогда
		ПутьКФайлу = ВыбранныеФайлы[0];		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокРеквизитов()
	
	ВыгружаемыеРеквизиты.Очистить();
	
	Для Каждого РеквизитДокТендер Из Метаданные.Документы.АГ_Тендер.Реквизиты Цикл
		ВыгружаемыеРеквизиты.Добавить(РеквизитДокТендер.Имя,РеквизитДокТендер.Синоним,Истина);	
	КонецЦикла;	
	
КонецФункции	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСписокРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период.ДатаНачала = НачалоПериода;
	Диалог.Период.ДатаОкончания = КонецДня(КонецПериода);
	Диалог.Показать(Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период <> Неопределено Тогда
		НачалоПериода = Период.ДатаНачала;
		КонецПериода = Период.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
	ПечатнаяФорма	= ВыгрузитьНаСервере();
	
	Если ВРег(Прав(ПутьКФайлу,4))="XLSX" Тогда
		ТипФайла	= ТипФайлаТабличногоДокумента.XLSX;	
	Иначе
		ТипФайла	= ТипФайлаТабличногоДокумента.XLS	
	КонецЕсли;	
	
	ПечатнаяФорма.Записать(ПутьКФайлу,ТипФайла);
	Сообщить("Файл "+ПутьКФайлу+" сохранен");
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьНаСервере()
	
	ТабВывод	= Новый ТабличныйДокумент;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет	= ОбработкаОбъект.ПолучитьМакет("МакетВыгрузки");
	
	ЭтоПервыйСтолбец	= Истина;
	Для Каждого Реквизит ИЗ ВыгружаемыеРеквизиты Цикл
		Если Реквизит.Пометка Тогда
			ОбластьШапка	= Макет.ПолучитьОбласть("Шапка");	
			ОбластьШапка.Параметры.НаименованиеКолонки	= Реквизит.Представление;
			Если ЭтоПервыйСтолбец Тогда
				ТабВывод.Вывести(ОбластьШапка);
				ЭтоПервыйСтолбец	= Ложь;
			Иначе
				ТабВывод.Присоединить(ОбластьШапка);
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	Документ.АГ_Тендер КАК АГ_Тендер
		|ГДЕ
		|	АГ_Тендер.ПометкаУдаления = ЛОЖЬ
		|	И АГ_Тендер.Дата МЕЖДУ &НачДата И &КонДата
		|	И (АГ_Тендер.Организация = &Организация
		|			ИЛИ &БезОтбораПоОрганизации)
		|	И (АГ_Тендер.ОтветственныйЗаРаспределение = &ОтветственныйЗаРаспределение
		|			ИЛИ &БезОтбораПоОтветственномуЗаРаспределение)
		|	И (АГ_Тендер.ОтветственныйЗаМониторинг = &ОтветственныйЗаМониторинг
		|			ИЛИ &БезОтбораПоОтветственномуЗаМониторинг)
		|	И (АГ_Тендер.Ответственный = &Ответственный
		|			ИЛИ &БезОтбораПоОтветственному)
		|
		|УПОРЯДОЧИТЬ ПО
		|	АГ_Тендер.Дата";
	
	Запрос.УстановитьПараметр("БезОтбораПоОрганизации", НЕ ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("БезОтбораПоОтветственному", НЕ ЗначениеЗаполнено(Менеджер));
	Запрос.УстановитьПараметр("БезОтбораПоОтветственномуЗаМониторинг", НЕ ЗначениеЗаполнено(ОтветственныйЗаМониторинг));
	Запрос.УстановитьПараметр("БезОтбораПоОтветственномуЗаРаспределение", НЕ ЗначениеЗаполнено(КураторОЭТ));
	Запрос.УстановитьПараметр("КонДата", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("НачДата", НачалоПериода);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ответственный", Менеджер);
	Запрос.УстановитьПараметр("ОтветственныйЗаМониторинг", ОтветственныйЗаМониторинг);
	Запрос.УстановитьПараметр("ОтветственныйЗаРаспределение", КураторОЭТ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЭтоПервыйСтолбец	= Истина;
		Для Каждого Реквизит ИЗ ВыгружаемыеРеквизиты Цикл
			Если Реквизит.Пометка Тогда
				ОбластьСтрока	= Макет.ПолучитьОбласть("Строка");	
				ОбластьСтрока.Параметры.ЗначениеРеквизита	= ВыборкаДетальныеЗаписи[Реквизит.Значение];
				Если ЭтоПервыйСтолбец Тогда
					ТабВывод.Вывести(ОбластьСтрока);
					ЭтоПервыйСтолбец	= Ложь;
				Иначе
					ТабВывод.Присоединить(ОбластьСтрока);
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТабВывод;
	
КонецФункции
